<a href="https://colab.research.google.com/github/MariamSherifAfifi/CS495/blob/master/Copy_of_Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
pd.options.display.max_columns=30
pd.options.display.float_format = '{:.2f}'.format

In [ ]:
df=pd.read_csv("/Sales Data.csv")

In [ ]:
df

           Date  EMP ID Product ID  Unit Sold
0      1-Jan-19   10019     P10007        199
1      1-Jan-19   10005     P10001         71
2      1-Jan-19   10004     P10019        201
3      1-Jan-19   10014     P10022        246
4      1-Jan-19   10005     P10004        106
...         ...     ...        ...        ...
6485  20-Apr-19   10015     P10002        150
6486  20-Apr-19   10007     P10023        145
6487  20-Apr-19   10011     P10009        215
6488  20-Apr-19   10012     P10029        206
6489  20-Apr-19   10006     P10019        263

[6490 rows x 4 columns]

In [ ]:
print (df['Product ID'])

0       P10007
1       P10001
2       P10019
3       P10022
4       P10004
         ...
6485    P10002
6486    P10023
6487    P10009
6488    P10029
6489    P10019
Name: Product ID, Length: 6490, dtype: object

In [ ]:
print ((df['Product ID']).isnull())

0       False
1       False
2       False
3       False
4       False
        ...
6485    False
6486    False
6487    False
6488    False
6489    False
Name: Product ID, Length: 6490, dtype: bool

In [ ]:
print (df.isnull().sum())

Date          0
EMP ID        0
Product ID    0
Unit Sold     0
dtype: int64